In [2]:
import pandas as pd

In [36]:
df = pd.read_csv("chicago.csv")
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [34]:
df["Department"].nunique()
df["Department"] = df["Department"].astype("category")

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

## Common String Methods - `.lower ()`, `.upper()`, `.title()`, and `.len()`

In [63]:
df = pd.read_csv("chicago.csv")
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [44]:
df["Name"].str.lower().str.upper()
# the additional '.str' is so that it doesn't come in conflict with the python syntax for the string methods

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [47]:
df["Position Title"].str.title() # brand new series
df["Position Title"] = df["Position Title"].str.title()
df.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  Water Rate Taker  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    Police Officer       POLICE              $84450.00
2     AARON,  KARINA    Police Officer       POLICE              $84450.00

In [64]:
len(df["Department"]) # gets number of rows
df["Department"].str.len() # gets the number of characters each row

0        11.0
1         6.0
2         6.0
3        16.0
4        11.0
         ...
32058     6.0
32059     6.0
32060     6.0
32061     4.0
32062     NaN
Name: Department, Length: 32063, dtype: float64

## The `.str.replace()` Method

In [83]:
df = pd.read_csv("chicago.csv").dropna(how = "all") # removes all rows with NaN values
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [84]:
df["Department"] = df["Department"].str.replace("MGMNT","MANAGEMENT")
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,$106836.00

In [85]:
df["Employee Annual Salary"] = df["Employee Annual Salary"].str.replace("$","").astype("float") 
# "" means replace it with nothing (or just remove)

In [86]:
df.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  float64
dtypes: float64(1), object(3)
memory usage: 1.2+ MB

In [89]:
df["Employee Annual Salary"].nlargest(10) # to test if the column really changed from string to float

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
19208    195000.0
3706     187680.0
18556    187680.0
29466    187680.0
13754    185364.0
Name: Employee Annual Salary, dtype: float64

## Filtering with String Methods

In [5]:
df = pd.read_csv("chicago.csv", index_col = "Name").dropna(how = "all")
df["Department"] = df["Department"].astype("category")
df.tail(3)

                              Position Title Department Employee Annual Salary
Name
ZYMANTAS,  MARK E             POLICE OFFICER     POLICE              $84450.00
ZYRKOWSKI,  CARLO E           POLICE OFFICER     POLICE              $87384.00
ZYSKOWSKI,  DARIUSZ  CHIEF DATA BASE ANALYST       DoIT             $113664.00

In [6]:
mask = df["Position Title"].str.lower().str.contains("water") # .str.contains() single argument

In [7]:
df[mask]

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MGMNT,$109272.00
"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
...,...,...,...
"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MGMNT,$111192.00
"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MGMNT,$89676.00
"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MGMNT,$115704.00
"WILLIAMS, MATTHEW",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
"WOODRIDGE, ROBERT L",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00

In [8]:
mask2 = df["Position Title"].str.lower().str.startswith("water") # head

In [9]:
df[mask2]

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
"ASHLEY, KARMA T",WATER CHEMIST II,WATER MGMNT,$82044.00
"ATKINS, JOANNA M",WATER CHEMIST II,WATER MGMNT,$82044.00
"AZEEM, MOHAMMED A",WATER CHEMIST II,WATER MGMNT,$53172.00
...,...,...,...
"THREATT, DENISE R",WATER QUALITY INSPECTOR,WATER MGMNT,$62004.00
"TIGNOR, DARRYL B",WATER RATE TAKER,WATER MGMNT,$78948.00
"TRAVIS COOK, LESLIE R",WATER RATE TAKER,WATER MGMNT,$78948.00
"VELAZQUEZ, JOHN",WATER RATE TAKER,WATER MGMNT,$78948.00
"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MGMNT,$89676.00

In [10]:
mask3 = df["Position Title"].str.lower().str.endswith("ist") # tail

In [11]:
df[mask3]

,Position Title,Department,Employee Annual Salary
Name,,,
"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,$99840.00
"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,$81948.00
"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,$89880.00
"ALLEN, ROBERT",MACHINIST,WATER MGMNT,$94328.00
"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,$91476.00
...,...,...,...
"YODER, TERESA G",ARCHIVAL SPECIALIST,PUBLIC LIBRARY,$74304.00
"YOUNGBLOOM, LAURENCE G",CRIMES SURVEILLANCE SPECIALIST,OEMC,$19676.80
"YOUNG, KIMBERLY M",SR PROCUREMENT SPECIALIST,PROCUREMENT,$68556.00
"ZAPATA, HUGO",SR PROCUREMENT SPECIALIST,PROCUREMENT,$87324.00
"ZEMKE, RICHARD P",MACHINIST,AVIATION,$94328.00

## More String methods - `.strip()`, `.lstrip()`, and `.rstrip()`

In [12]:
df = pd.read_csv("chicago.csv")
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [13]:
df["Name"] = df["Name"].str.strip()

In [14]:
df["Position Title"] = df["Position Title"].str.lstrip().str.rstrip()

## String Methods on Index and Columns

In [15]:
df = pd.read_csv("chicago.csv", index_col = "Name").dropna(how = "all")
df["Department"] = df["Department"].astype("category")
df.tail(3)

                              Position Title Department Employee Annual Salary
Name
ZYMANTAS,  MARK E             POLICE OFFICER     POLICE              $84450.00
ZYRKOWSKI,  CARLO E           POLICE OFFICER     POLICE              $87384.00
ZYSKOWSKI,  DARIUSZ  CHIEF DATA BASE ANALYST       DoIT             $113664.00

In [20]:
df.index = df.index.str.strip().str.title() # overwrites
df.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [24]:
df.columns = df.columns.str.upper()
df.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

## Split Strings by Characters with `.str.split()` Method

In [33]:
df = pd.read_csv("chicago.csv").dropna(how = "all")
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [44]:
"Hello my name is Alyssa".split()
# turns the strings to a list by delimiter
# .get() is a complementary method for the split method

['Hello', 'my', 'name', 'is', 'Alyssa']

In [38]:
df["Name"].str.split(",").str.get(0).str.title().value_counts()
# .str.get(0) is getting the first index, which is the lastname of each row list

Williams    293
Johnson     244
Smith       241
Brown       185
Jones       183
           ...
Crylen        1
Badal         1
Montijo       1
Mcghee        1
Speller       1
Name: Name, Length: 13829, dtype: int64

In [41]:
df["Position Title"].str.split(" ").str.get(0).str.title().value_counts()
# list of different item types

Police              10856
Firefighter-Emt      1509
Sergeant             1186
Pool                  918
Firefighter           810
                    ...
Superintendent'S        1
Manager-Fleet           1
Comm                    1
Production              1
Leasing                 1
Name: Position Title, Length: 320, dtype: int64

### More Practice with Splits

In [42]:
df = pd.read_csv("chicago.csv").dropna(how = "all")
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [43]:
df["Name"].str.split(",").str.get(0).value_counts().head(3)

WILLIAMS    293
JOHNSON     244
SMITH       241
Name: Name, dtype: int64

In [56]:
df["Name"].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).str.title().value_counts().head()
# the strip removes the space so it doesn't produce a weird list

Michael    1153
John        899
James       676
Robert      622
Joseph      537
Name: Name, dtype: int64

### The `expand` and `n` Parameters of the `.str.split()` Method

In [57]:
df = pd.read_csv("chicago.csv").dropna(how = "all")
df["Department"] = df["Department"].astype("category")
df.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [67]:
df[["First Name","Last Name"]] = df["Name"].str.split(",", expand = True)
# concatenates the data

df.head(3)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA

In [76]:
df[["First Title Word","Remaining Words"]] = df["Position Title"].str.split(" ", expand = True, n = 1)
# n = maximum number of splits
# remainder is left in the last column 
df.head(3)

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,First Title Word,Remaining Words
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA,POLICE,OFFICER